[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Pricing.cs:27:37
         };
 
         // Peak hours: 18:00 - 22:00
-        if (classTime.Hour >= 18 && classTime.Hour < 22)
+        if (classTime.Hour >= 18 && classTime.Hour > 22)
         {
             price *= 1.2m;
killedBy: Fitness_Service_UnitTest.PricingServiceTests.CalculatePrice_ShouldIncreasePrice_DuringPeakHours

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Pricing.cs:27:13
         };
 
         // Peak hours: 18:00 - 22:00
-        if (classTime.Hour >= 18 && classTime.Hour < 22)
+        if (classTime.Hour < 18 && classTime.Hour < 22)
         {
             price *= 1.2m;
killedBy: Fitness_Service_UnitTest.PricingServiceTests.CalculatePrice_ShouldIncreasePrice_DuringPeakHours
