[NoCoverage] Statement mutation
repos/CEN315 Fitness Service/Fitness_Service_API/Program.cs:6:1
 var builder = WebApplication.CreateBuilder(args);
 
 // Add controllers
-builder.Services.AddControllers();
+;
 
 // Register domain services

[NoCoverage] Statement mutation
repos/CEN315 Fitness Service/Fitness_Service_API/Program.cs:9:1
 builder.Services.AddControllers();
 
 // Register domain services
-builder.Services.AddScoped<IPricingService, PricingService>();
+;
 builder.Services.AddScoped<IReservationService, ReservationService>();
 

[NoCoverage] Statement mutation
repos/CEN315 Fitness Service/Fitness_Service_API/Program.cs:10:1
 
 // Register domain services
 builder.Services.AddScoped<IPricingService, PricingService>();
-builder.Services.AddScoped<IReservationService, ReservationService>();
+;
 
 // Swagger (very useful for demo & Postman)

[NoCoverage] Statement mutation
repos/CEN315 Fitness Service/Fitness_Service_API/Program.cs:13:1
 builder.Services.AddScoped<IReservationService, ReservationService>();
 
 // Swagger (very useful for demo & Postman)
-builder.Services.AddEndpointsApiExplorer();
+;
 builder.Services.AddSwaggerGen();
 

[NoCoverage] Negate expression
repos/CEN315 Fitness Service/Fitness_Service_API/Program.cs:19:5
 var app = builder.Build();
 
 // Configure HTTP pipeline
-if (app.Environment.IsDevelopment())
+if (!(app.Environment.IsDevelopment()))
 {
     app.UseSwagger();

[NoCoverage] Statement mutation
repos/CEN315 Fitness Service/Fitness_Service_API/Program.cs:27:1
 
 app.UseHttpsRedirection();
 
-app.UseAuthorization();
+;
 
 app.MapControllers();
