[NoCoverage] Statement mutation
repos/CEN315 Fitness Service/Fitness_Service_API/Program.cs:10:1
 // SERVICE REGISTRATION (Moved to Testable Method)
 // =================================================================
 // This single line replaces all the builder.Services.Add... calls
-builder.Services.AddApplicationServices();
+;
 
 var app = builder.Build();

[NoCoverage] Negate expression
repos/CEN315 Fitness Service/Fitness_Service_API/Program.cs:17:5
 // =================================================================
 // MIDDLEWARE PIPELINE (Remains in Program.cs)
 // =================================================================
-if (app.Environment.IsDevelopment())
+if (!(app.Environment.IsDevelopment()))
 {
     app.UseSwagger();
