[Killed] Statement mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_FitnessClass.cs:14:9
     [HttpPost]
     public IActionResult CreateClass(FitnessClass fitnessClass)
     {
-        InMemoryDatabase.Classes.Add(fitnessClass);
+        ;
         return CreatedAtAction(nameof(GetClasses), new { id = fitnessClass.Id }, fitnessClass);
     }
killedBy: Fitness_Service_UnitTest.Controllers.ClassesControllerTests.CreateClass_ShouldAddToDatabase_AndReturnCreated

[Killed] Block removal mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_FitnessClass.cs:20:5
 
     [HttpGet]
     public IActionResult GetClasses()
-    {
-        return Ok(InMemoryDatabase.Classes);
-    }
+    {}
 }
 
killedBy: Fitness_Service_UnitTest.Controllers.ClassesControllerTests.GetClasses_ShouldReturnAllClasses_FromDatabase
