[Killed] Statement mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Member.cs:14:9
     [HttpPost]
     public IActionResult AddMember(Member member)
     {
-        InMemoryDatabase.Members.Add(member);
+        ;
         return CreatedAtAction(nameof(GetMember), new { id = member.Id }, member);
     }
killedBy: Fitness_Service_UnitTest.Controllers.MembersControllerTests.AddMember_ShouldAddToDatabase_AndReturnCreated

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Member.cs:21:67
     [HttpGet("{id}")]
     public IActionResult GetMember(Guid id)
     {
-        var member = InMemoryDatabase.Members.FirstOrDefault(m => m.Id == id);
+        var member = InMemoryDatabase.Members.FirstOrDefault(m => m.Id != id);
         if (member == null)
             return NotFound();
killedBy: Fitness_Service_UnitTest.Controllers.MembersControllerTests.GetMember_ShouldReturnOk_WhenFound

[Killed] Linq method mutation (FirstOrDefault() to First())
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Member.cs:21:22
     [HttpGet("{id}")]
     public IActionResult GetMember(Guid id)
     {
-        var member = InMemoryDatabase.Members.FirstOrDefault(m => m.Id == id);
+        var member = InMemoryDatabase.Members.First(m => m.Id == id);
         if (member == null)
             return NotFound();
killedBy: Fitness_Service_UnitTest.Controllers.MembersControllerTests.GetMember_ShouldReturnNotFound_WhenIdDoesNotExist

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Member.cs:22:13
     public IActionResult GetMember(Guid id)
     {
         var member = InMemoryDatabase.Members.FirstOrDefault(m => m.Id == id);
-        if (member == null)
+        if (member != null)
             return NotFound();
 
killedBy: Fitness_Service_UnitTest.Controllers.MembersControllerTests.GetMember_ShouldReturnNotFound_WhenIdDoesNotExist; Fitness_Service_UnitTest.Controllers.MembersControllerTests.GetMember_ShouldReturnOk_WhenFound
