[Killed] Block removal mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Reservation.cs:12:5
     private readonly IReservationService _reservationService;
 
     public ReservationsController(IReservationService reservationService)
-    {
-        _reservationService = reservationService;
-    }
+    {}
 
     [HttpPost]
killedBy: Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.CreateReservation_ReturnsOk_WhenSuccessful; Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.Delete_ReturnsNoContent_WhenSuccessful; Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.CreateReservation_ReturnsBadRequest_WhenServiceThrowsException

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Reservation.cs:19:67
     [HttpPost]
     public IActionResult CreateReservation(Guid memberId, Guid classId)
     {
-        var member = InMemoryDatabase.Members.FirstOrDefault(m => m.Id == memberId);
+        var member = InMemoryDatabase.Members.FirstOrDefault(m => m.Id != memberId);
         var fitnessClass = InMemoryDatabase.Classes.FirstOrDefault(c => c.Id == classId);
 
killedBy: Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.CreateReservation_ReturnsOk_WhenSuccessful; Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.CreateReservation_ReturnsBadRequest_WhenServiceThrowsException

[Killed] Linq method mutation (FirstOrDefault() to First())
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Reservation.cs:19:22
     [HttpPost]
     public IActionResult CreateReservation(Guid memberId, Guid classId)
     {
-        var member = InMemoryDatabase.Members.FirstOrDefault(m => m.Id == memberId);
+        var member = InMemoryDatabase.Members.First(m => m.Id == memberId);
         var fitnessClass = InMemoryDatabase.Classes.FirstOrDefault(c => c.Id == classId);
 
killedBy: Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.CreateReservation_ReturnsBadRequest_WhenMemberDoesNotExist

[Killed] Linq method mutation (FirstOrDefault() to First())
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Reservation.cs:20:28
     public IActionResult CreateReservation(Guid memberId, Guid classId)
     {
         var member = InMemoryDatabase.Members.FirstOrDefault(m => m.Id == memberId);
-        var fitnessClass = InMemoryDatabase.Classes.FirstOrDefault(c => c.Id == classId);
+        var fitnessClass = InMemoryDatabase.Classes.First(c => c.Id == classId);
 
         if (member == null || fitnessClass == null)
killedBy: Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.CreateReservation_ReturnsBadRequest_WhenClassDoesNotExist

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Reservation.cs:20:73
     public IActionResult CreateReservation(Guid memberId, Guid classId)
     {
         var member = InMemoryDatabase.Members.FirstOrDefault(m => m.Id == memberId);
-        var fitnessClass = InMemoryDatabase.Classes.FirstOrDefault(c => c.Id == classId);
+        var fitnessClass = InMemoryDatabase.Classes.FirstOrDefault(c => c.Id != classId);
 
         if (member == null || fitnessClass == null)
killedBy: Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.CreateReservation_ReturnsOk_WhenSuccessful; Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.CreateReservation_ReturnsBadRequest_WhenServiceThrowsException

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Reservation.cs:22:13
         var member = InMemoryDatabase.Members.FirstOrDefault(m => m.Id == memberId);
         var fitnessClass = InMemoryDatabase.Classes.FirstOrDefault(c => c.Id == classId);
 
-        if (member == null || fitnessClass == null)
+        if (member != null || fitnessClass == null)
             return BadRequest("Invalid member or class.");
 
killedBy: Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.CreateReservation_ReturnsOk_WhenSuccessful; Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.CreateReservation_ReturnsBadRequest_WhenMemberDoesNotExist; Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.CreateReservation_ReturnsBadRequest_WhenServiceThrowsException

[Killed] Logical mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Reservation.cs:22:13
         var member = InMemoryDatabase.Members.FirstOrDefault(m => m.Id == memberId);
         var fitnessClass = InMemoryDatabase.Classes.FirstOrDefault(c => c.Id == classId);
 
-        if (member == null || fitnessClass == null)
+        if (member == null && fitnessClass == null)
             return BadRequest("Invalid member or class.");
 
killedBy: Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.CreateReservation_ReturnsBadRequest_WhenMemberDoesNotExist; Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.CreateReservation_ReturnsBadRequest_WhenClassDoesNotExist

[Killed] Block removal mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Reservation.cs:26:9
             return BadRequest("Invalid member or class.");
 
         try
-        {
-            var reservation = _reservationService.CreateReservation(member, fitnessClass);
-            return Ok(reservation);
-        }
+        {}
         catch (InvalidOperationException ex)
         {
killedBy: Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.CreateReservation_ReturnsOk_WhenSuccessful; Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.CreateReservation_ReturnsBadRequest_WhenServiceThrowsException

[Killed] Block removal mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Reservation.cs:31:9
             return Ok(reservation);
         }
         catch (InvalidOperationException ex)
-        {
-            return BadRequest(ex.Message);
-        }
+        {}
     }
 
killedBy: Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.CreateReservation_ReturnsBadRequest_WhenServiceThrowsException

[Killed] Block removal mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Reservation.cs:38:5
 
     [HttpGet]
     public IActionResult GetAll()
-    {
-        return Ok(InMemoryDatabase.Reservations);
-    }
+    {}
 
     [HttpGet("{id}")]
killedBy: Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.GetAll_ReturnsAllReservations

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Reservation.cs:45:77
     [HttpGet("{id}")]
     public IActionResult GetById(Guid id)
     {
-        var reservation = InMemoryDatabase.Reservations.FirstOrDefault(r => r.Id == id);
+        var reservation = InMemoryDatabase.Reservations.FirstOrDefault(r => r.Id != id);
         if (reservation == null)
             return NotFound();
killedBy: Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.GetById_ReturnsOk_WhenReservationExists

[Killed] Linq method mutation (FirstOrDefault() to First())
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Reservation.cs:45:27
     [HttpGet("{id}")]
     public IActionResult GetById(Guid id)
     {
-        var reservation = InMemoryDatabase.Reservations.FirstOrDefault(r => r.Id == id);
+        var reservation = InMemoryDatabase.Reservations.First(r => r.Id == id);
         if (reservation == null)
             return NotFound();
killedBy: Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.GetById_ReturnsNotFound_WhenReservationDoesNotExist

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Reservation.cs:46:13
     public IActionResult GetById(Guid id)
     {
         var reservation = InMemoryDatabase.Reservations.FirstOrDefault(r => r.Id == id);
-        if (reservation == null)
+        if (reservation != null)
             return NotFound();
 
killedBy: Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.GetById_ReturnsOk_WhenReservationExists; Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.GetById_ReturnsNotFound_WhenReservationDoesNotExist

[Killed] Statement mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Reservation.cs:57:13
     {
         try
         {
-            _reservationService.CancelReservation(id);
+            ;
             return NoContent();
         }
killedBy: Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.Delete_ReturnsNotFound_WhenServiceThrowsException

[Killed] Block removal mutation
CEN315 Fitness Service/Fitness_Service_API/Controllers/Controller_Reservation.cs:61:9
             return NoContent();
         }
         catch (InvalidOperationException ex)
-        {
-            return NotFound(ex.Message);
-        }
+        {}
     }
 }
killedBy: Fitness_Service_UnitTest.Controllers.ReservationsControllerTests.Delete_ReturnsNotFound_WhenServiceThrowsException
