[Survived] String mutation
CEN315 Fitness Service/Fitness_Service_API/Entities/Entitie_FitnessClass.cs:7:46
 {
     public Guid Id { get; set; } = Guid.NewGuid();
     public string Name { get; set; } = string.Empty;
-    public string Instructor { get; set; } = string.Empty;
+    public string Instructor { get; set; } = "Stryker was here!";
     public int Capacity { get; set; }
     public DateTime StartTime { get; set; }
