[Killed] MultiplyAssignmentExpression to DivideAssignmentExpression mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Pricing.cs:18:9
         decimal price = BasePrice;
 
         // Membership-based pricing
-        price *= membershipType switch
-        {
-            MembershipType.Standard => 1.0m,
-            MembershipType.Premium => 0.8m,
-            MembershipType.Student => 0.7m,
-            _ => throw new ArgumentOutOfRangeException(nameof(membershipType))
-        };
+        price /= membershipType switch
+        {
+            MembershipType.Standard => 1.0m,
+            MembershipType.Premium => 0.8m,
+            MembershipType.Student => 0.7m,
+            _ => throw new ArgumentOutOfRangeException(nameof(membershipType))
+        };
 
         // Peak hours: 18:00 - 22:00
killedBy: Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplyMembershipMultiplier_WhenOffPeakAndEmpty; Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplyMembershipMultiplier_WhenOffPeakAndEmpty; Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldCombineAllMultipliers_Correctly

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Pricing.cs:27:13
         };
 
         // Peak hours: 18:00 - 22:00
-        if (classTime.Hour >= 18 && classTime.Hour < 22)
+        if (classTime.Hour > 18 && classTime.Hour < 22)
         {
             price *= 1.2m;
killedBy: Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplyPeakMultiplier_OnlyWithinHours

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Pricing.cs:27:37
         };
 
         // Peak hours: 18:00 - 22:00
-        if (classTime.Hour >= 18 && classTime.Hour < 22)
+        if (classTime.Hour >= 18 && classTime.Hour <= 22)
         {
             price *= 1.2m;
killedBy: Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplyPeakMultiplier_OnlyWithinHours

[Killed] MultiplyAssignmentExpression to DivideAssignmentExpression mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Pricing.cs:29:13
         // Peak hours: 18:00 - 22:00
         if (classTime.Hour >= 18 && classTime.Hour < 22)
         {
-            price *= 1.2m;
+            price /= 1.2m;
         }
 
killedBy: Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplyPeakMultiplier_OnlyWithinHours; Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplyPeakMultiplier_OnlyWithinHours; Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldCombineAllMultipliers_Correctly

[Killed] Negate expression
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Pricing.cs:33:13
         }
 
         // Surge pricing if occupancy > 80%
-        if (capacity > 0)
+        if (!(capacity > 0))
         {
             decimal occupancyRate = (decimal)currentReservations / capacity;
killedBy: Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplySurge_WhenOccupancyExceedsEightyPercent; Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplySurge_WhenOccupancyExceedsEightyPercent; Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldCombineAllMultipliers_Correctly

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Pricing.cs:33:13
         }
 
         // Surge pricing if occupancy > 80%
-        if (capacity > 0)
+        if (capacity < 0)
         {
             decimal occupancyRate = (decimal)currentReservations / capacity;
killedBy: Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplySurge_WhenOccupancyExceedsEightyPercent; Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplySurge_WhenOccupancyExceedsEightyPercent; Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldCombineAllMultipliers_Correctly

[Killed] Arithmetic mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Pricing.cs:35:37
         // Surge pricing if occupancy > 80%
         if (capacity > 0)
         {
-            decimal occupancyRate = (decimal)currentReservations / capacity;
+            decimal occupancyRate = (decimal)currentReservations * capacity;
             if (occupancyRate > 0.8m)
             {
killedBy: Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplySurge_WhenOccupancyExceedsEightyPercent; Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplySurge_WhenOccupancyExceedsEightyPercent

[Killed] Negate expression
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Pricing.cs:36:17
         if (capacity > 0)
         {
             decimal occupancyRate = (decimal)currentReservations / capacity;
-            if (occupancyRate > 0.8m)
+            if (!(occupancyRate > 0.8m))
             {
                 price *= 1.3m;
killedBy: Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplyPeakMultiplier_OnlyWithinHours; Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplyPeakMultiplier_OnlyWithinHours; Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplyPeakMultiplier_OnlyWithinHours

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Pricing.cs:36:17
         if (capacity > 0)
         {
             decimal occupancyRate = (decimal)currentReservations / capacity;
-            if (occupancyRate > 0.8m)
+            if (occupancyRate < 0.8m)
             {
                 price *= 1.3m;
killedBy: Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplyPeakMultiplier_OnlyWithinHours; Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplyPeakMultiplier_OnlyWithinHours; Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplyPeakMultiplier_OnlyWithinHours

[Killed] MultiplyAssignmentExpression to DivideAssignmentExpression mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Pricing.cs:38:17
             decimal occupancyRate = (decimal)currentReservations / capacity;
             if (occupancyRate > 0.8m)
             {
-                price *= 1.3m;
+                price /= 1.3m;
             }
         }
killedBy: Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplySurge_WhenOccupancyExceedsEightyPercent; Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldApplySurge_WhenOccupancyExceedsEightyPercent; Fitness_Service_UnitTest.Services.PricingServiceTests.CalculatePrice_ShouldCombineAllMultipliers_Correctly
