[Killed] Block removal mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:11:5
     private readonly IPricingService _pricingService;
 
     public ReservationService(IPricingService pricingService)
-    {
-        _pricingService = pricingService;
-    }
+    {}
 
     public Reservation CreateReservation(Member member, FitnessClass fitnessClass)
killedBy: Fitness_Service_UnitTest.ReservationPropertiesTests.Reservation_Final_Count_Matches_Min_Of_Attempts_And_Capacity; Fitness_Service_UnitTest.Services.ReservationServiceTests.CreateReservation_ShouldAddReservationToClass_WhenSpaceAvailable; Fitness_Service_UnitTest.Services.ReservationServiceTests.CreateReservation_ShouldPassCorrectReservationCount_ToPricing

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:18:13
     public Reservation CreateReservation(Member member, FitnessClass fitnessClass)
     {
 
-        if (member == null)
+        if (member != null)
             throw new ArgumentNullException(nameof(member));
 
killedBy: Fitness_Service_UnitTest.ReservationPropertiesTests.Reservation_Final_Count_Matches_Min_Of_Attempts_And_Capacity; Fitness_Service_UnitTest.Services.ReservationServiceTests.CreateReservation_ShouldThrowArgumentNull_WhenInputsAreNull; Fitness_Service_UnitTest.Services.ReservationServiceTests.CreateReservation_ShouldAddReservationToClass_WhenSpaceAvailable

[Killed] Statement mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:19:13
     {
 
         if (member == null)
-            throw new ArgumentNullException(nameof(member));
+            ;
 
         if (fitnessClass == null)
killedBy: Fitness_Service_UnitTest.Services.ReservationServiceTests.CreateReservation_ShouldThrowArgumentNull_WhenInputsAreNull

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:21:13
         if (member == null)
             throw new ArgumentNullException(nameof(member));
 
-        if (fitnessClass == null)
+        if (fitnessClass != null)
             throw new ArgumentNullException(nameof(fitnessClass));
 
killedBy: Fitness_Service_UnitTest.ReservationPropertiesTests.Reservation_Final_Count_Matches_Min_Of_Attempts_And_Capacity; Fitness_Service_UnitTest.Services.ReservationServiceTests.CreateReservation_ShouldThrowArgumentNull_WhenInputsAreNull; Fitness_Service_UnitTest.Services.ReservationServiceTests.CreateReservation_ShouldAddReservationToClass_WhenSpaceAvailable

[Killed] Statement mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:22:13
             throw new ArgumentNullException(nameof(member));
 
         if (fitnessClass == null)
-            throw new ArgumentNullException(nameof(fitnessClass));
+            ;
 
 
killedBy: Fitness_Service_UnitTest.Services.ReservationServiceTests.CreateReservation_ShouldThrowArgumentNull_WhenInputsAreNull

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:25:13
             throw new ArgumentNullException(nameof(fitnessClass));
 
 
-        if (fitnessClass.Reservations.Count >= fitnessClass.Capacity)
+        if (fitnessClass.Reservations.Count > fitnessClass.Capacity)
             throw new InvalidOperationException("Class capacity exceeded.");
 
killedBy: Fitness_Service_UnitTest.ReservationPropertiesTests.Reservation_Final_Count_Matches_Min_Of_Attempts_And_Capacity; Fitness_Service_UnitTest.Services.ReservationServiceTests.CreateReservation_ShouldThrowException_WhenClassIsExactlyFull

[Killed] Negate expression
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:25:13
             throw new ArgumentNullException(nameof(fitnessClass));
 
 
-        if (fitnessClass.Reservations.Count >= fitnessClass.Capacity)
+        if (!(fitnessClass.Reservations.Count >= fitnessClass.Capacity))
             throw new InvalidOperationException("Class capacity exceeded.");
 
killedBy: Fitness_Service_UnitTest.ReservationPropertiesTests.Reservation_Final_Count_Matches_Min_Of_Attempts_And_Capacity; Fitness_Service_UnitTest.Services.ReservationServiceTests.CreateReservation_ShouldAddReservationToClass_WhenSpaceAvailable; Fitness_Service_UnitTest.Services.ReservationServiceTests.CreateReservation_ShouldThrowException_WhenClassIsExactlyFull

[Killed] Statement mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:26:13
 
 
         if (fitnessClass.Reservations.Count >= fitnessClass.Capacity)
-            throw new InvalidOperationException("Class capacity exceeded.");
+            ;
 
         decimal price = _pricingService.CalculatePrice(
killedBy: Fitness_Service_UnitTest.ReservationPropertiesTests.Reservation_Final_Count_Matches_Min_Of_Attempts_And_Capacity; Fitness_Service_UnitTest.Services.ReservationServiceTests.CreateReservation_ShouldThrowException_WhenClassIsExactlyFull

[Killed] Object initializer mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:34:27
             fitnessClass.Capacity,
             fitnessClass.Reservations.Count);
 
-        var reservation = new Reservation
-        {
-            MemberId = member.Id,
-            FitnessClassId = fitnessClass.Id,
-            PricePaid = price
-        };
+        var reservation = new Reservation
+{};
 
         fitnessClass.Reservations.Add(reservation);
killedBy: Fitness_Service_UnitTest.Services.ReservationServiceTests.CreateReservation_ShouldAddReservationToClass_WhenSpaceAvailable

[Killed] Statement mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:41:9
             PricePaid = price
         };
 
-        fitnessClass.Reservations.Add(reservation);
+        ;
         InMemoryDatabase.Reservations.Add(reservation);
 
killedBy: Fitness_Service_UnitTest.ReservationPropertiesTests.Reservation_Final_Count_Matches_Min_Of_Attempts_And_Capacity; Fitness_Service_UnitTest.Services.ReservationServiceTests.CreateReservation_ShouldAddReservationToClass_WhenSpaceAvailable

[Survived] Statement mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:42:9
         };
 
         fitnessClass.Reservations.Add(reservation);
-        InMemoryDatabase.Reservations.Add(reservation);
+        ;
 
         return reservation;

[Survived] Linq method mutation (FirstOrDefault() to First())
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:49:27
 
     public void CancelReservation(Guid reservationId)
     {
-        var reservation = InMemoryDatabase.Reservations
-            .FirstOrDefault(r => r.Id == reservationId);
+        var reservation = InMemoryDatabase.Reservations
+            .First(r => r.Id == reservationId);
 
         if (reservation == null)

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:50:34
     public void CancelReservation(Guid reservationId)
     {
         var reservation = InMemoryDatabase.Reservations
-            .FirstOrDefault(r => r.Id == reservationId);
+            .FirstOrDefault(r => r.Id != reservationId);
 
         if (reservation == null)
killedBy: Fitness_Service_UnitTest.Services.ReservationServiceTests.CancelReservation_ShouldThrow_WhenNotFound; Fitness_Service_UnitTest.Services.ReservationServiceTests.CancelReservation_ShouldRemoveFromClass_WhenFound

[Killed] Equality mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:52:13
         var reservation = InMemoryDatabase.Reservations
             .FirstOrDefault(r => r.Id == reservationId);
 
-        if (reservation == null)
+        if (reservation != null)
             throw new InvalidOperationException("Reservation not found.");
 
killedBy: Fitness_Service_UnitTest.Services.ReservationServiceTests.CancelReservation_ShouldThrow_WhenNotFound; Fitness_Service_UnitTest.Services.ReservationServiceTests.CancelReservation_ShouldRemoveFromClass_WhenFound

[Killed] Statement mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:53:13
             .FirstOrDefault(r => r.Id == reservationId);
 
         if (reservation == null)
-            throw new InvalidOperationException("Reservation not found.");
+            ;
 
         InMemoryDatabase.Reservations.Remove(reservation);
killedBy: Fitness_Service_UnitTest.Services.ReservationServiceTests.CancelReservation_ShouldThrow_WhenNotFound

[Survived] String mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:53:49
             .FirstOrDefault(r => r.Id == reservationId);
 
         if (reservation == null)
-            throw new InvalidOperationException("Reservation not found.");
+            throw new InvalidOperationException("");
 
         InMemoryDatabase.Reservations.Remove(reservation);

[Killed] Statement mutation
CEN315 Fitness Service/Fitness_Service_API/Services/Service_Reservation.cs:55:9
         if (reservation == null)
             throw new InvalidOperationException("Reservation not found.");
 
-        InMemoryDatabase.Reservations.Remove(reservation);
+        ;
     }
 }
killedBy: Fitness_Service_UnitTest.Services.ReservationServiceTests.CancelReservation_ShouldRemoveFromClass_WhenFound
