[Killed] Statement mutation
CEN315 Fitness Service/Fitness_Service_API/Infrastructure/ServiceRegistration.cs:12:13
         public static void AddApplicationServices(this IServiceCollection services)
         {
             // 1. Controllers
-            services.AddControllers();
+            ;
 
             // 2. Domain Services (The Logic you want to protect from Mutants)
killedBy: Fitness_Service_UnitTest.ServiceRegistrationTests.AddApplicationServices_ShouldRegister_AllDependencies_WithCorrectLifetimes

[Killed] Statement mutation
CEN315 Fitness Service/Fitness_Service_API/Infrastructure/ServiceRegistration.cs:15:13
             services.AddControllers();
 
             // 2. Domain Services (The Logic you want to protect from Mutants)
-            services.AddScoped<IPricingService, PricingService>();
+            ;
             services.AddScoped<IReservationService, ReservationService>();
 
killedBy: Fitness_Service_UnitTest.ServiceRegistrationTests.AddApplicationServices_ShouldRegister_AllDependencies_WithCorrectLifetimes

[Killed] Statement mutation
CEN315 Fitness Service/Fitness_Service_API/Infrastructure/ServiceRegistration.cs:16:13
 
             // 2. Domain Services (The Logic you want to protect from Mutants)
             services.AddScoped<IPricingService, PricingService>();
-            services.AddScoped<IReservationService, ReservationService>();
+            ;
 
             // 3. Swagger Configuration
killedBy: Fitness_Service_UnitTest.ServiceRegistrationTests.AddApplicationServices_ShouldRegister_AllDependencies_WithCorrectLifetimes

[Survived] Statement mutation
CEN315 Fitness Service/Fitness_Service_API/Infrastructure/ServiceRegistration.cs:19:13
             services.AddScoped<IReservationService, ReservationService>();
 
             // 3. Swagger Configuration
-            services.AddEndpointsApiExplorer();
+            ;
             services.AddSwaggerGen();
         }

[Killed] Statement mutation
CEN315 Fitness Service/Fitness_Service_API/Infrastructure/ServiceRegistration.cs:20:13
 
             // 3. Swagger Configuration
             services.AddEndpointsApiExplorer();
-            services.AddSwaggerGen();
+            ;
         }
     }
killedBy: Fitness_Service_UnitTest.ServiceRegistrationTests.AddApplicationServices_ShouldRegister_AllDependencies_WithCorrectLifetimes
